Repository: engraad/faceattct
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: System Settings
ar: إعدادات النظام

source: Account Management - Attendance System
ar: إدارة الحسابات - نظام الحضور

source: User Account Management
ar: إدارة حسابات المستخدمين

source: Add and edit system user accounts
ar: إضافة وتعديل حسابات مستخدمي النظام

source: Add New Account
ar: إضافة حساب جديد

source: Email
ar: البريد الإلكتروني

source: Role
ar: الدور

source: Linked Employee
ar: الموظف المرتبط

source: Creation Date
ar: تاريخ الإنشاء

source: Actions
ar: الإجراءات

source: Edit User Account
ar: تعديل حساب المستخدم

source: Employee
ar: الموظف

source: Admin
ar: مدير

source: Link to Employee (Optional)
ar: ربط بالموظف (اختياري)

source: Cancel
ar: إلغاء

source: Save Changes
ar: حفظ التغييرات

source: Password
ar: كلمة المرور

source: No link
ar: لا يوجد رابط

source: Add Account
ar: إضافة حساب

source: Are you sure?
ar: هل أنت متأكد؟

source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: Confirm
ar: تأكيد

source: Success!
ar: نجح!

source: The operation was successful.
ar: تمت العملية بنجاح.

source: New Password:
ar: كلمة المرور الجديدة:

source: Please provide this password to the user securely and save it in a safe place.
ar: يرجى توفير كلمة المرور هذه للمستخدم بأمان وحفظها في مكان آمن.

source: OK
ar: موافق

source: An error occurred!
ar: حدث خطأ!

source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Loading accounts...
ar: جاري تحميل الحسابات...

source: Failed to load the list of accounts from the server.
ar: فشل في تحميل قائمة الحسابات من الخادم.

source: No accounts to display.
ar: لا توجد حسابات للعرض.

source: <span class="text-slate-400">Not linked</span>
ar: <span class="text-slate-400">غير مرتبط</span>

source: Edit Account
ar: تعديل الحساب

source: Delete Account
ar: حذف الحساب

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Failed to load the list of employees.
ar: فشل في تحميل قائمة الموظفين.

source: Added
ar: تمت الإضافة

source: The new account has been created successfully.
ar: تم إنشاء الحساب الجديد بنجاح.

source: Failed to add account
ar: فشل في إضافة الحساب

source: Updated
ar: تم التحديث

source: The account details have been updated successfully.
ar: تم تحديث تفاصيل الحساب بنجاح.

source: Failed to update account
ar: فشل في تحديث الحساب

source: Confirm Deletion
ar: تأكيد الحذف

source: Are you sure you want to permanently delete this account?
ar: هل أنت متأكد أنك تريد حذف هذا الحساب نهائيًا؟

source: Deleted
ar: تم الحذف

source: The account has been deleted successfully.
ar: تم حذف الحساب بنجاح.

source: Failed to delete account
ar: فشل في حذف الحساب

source: A new random password will be generated. Do you want to continue?
ar: سيتم إنشاء كلمة مرور عشوائية جديدة. هل تريد المتابعة؟

source: Reset Successful
ar: تمت إعادة التعيين بنجاح

source: The password has been reset successfully.
ar: تم إعادة تعيين كلمة المرور بنجاح.

source: Failed to reset password
ar: فشل في إعادة تعيين كلمة المرور

source: Copied!
ar: تم النسخ!

source: Attendance History - Admin Dashboard
ar: تاريخ الحضور - لوحة تحكم المدير

source: Filter Attendance Records
ar: تصفية سجلات الحضور

source: All Employees
ar: جميع الموظفين

source: Start Date
ar: تاريخ البداية

source: End Date
ar: تاريخ النهاية

source: Status
ar: الحالة

source: All Status
ar: جميع الحالات

source: Present
ar: حاضر

source: Absent
ar: غائب

source: Late
ar: متأخر

source: Apply Filters
ar: تطبيق المرشحات

source: Attendance Records
ar: سجلات الحضور

source: Export
ar: تصدير

source: Refresh
ar: تحديث

source: Loading attendance records...
ar: جاري تحميل سجلات الحضور...

source: Date
ar: التاريخ

source: Check In
ar: تسجيل الدخول

source: Check Out
ar: تسجيل الخروج

source: Duration
ar: المدة

source: No Attendance Records Found
ar: لا توجد سجلات حضور

source: Try adjusting your filters or check back later.
ar: حاول تعديل مرشحاتك أو تحقق مرة أخرى لاحقاً.

source: Total Records
ar: إجمالي السجلات

source: Attendance Rate
ar: معدل الحضور

source: On time
ar: في الوقت

source: m late
ar: دقيقة متأخر

source: Showing
ar: عرض

source: of
ar: من

source: records
ar: سجل

source: Page
ar: صفحة

source: Error loading employees:
ar: خطأ في تحميل الموظفين:

source: Error loading summary:
ar: خطأ في تحميل الملخص:

source: Error loading attendance data:
ar: خطأ في تحميل بيانات الحضور:

source: Daily Report
ar: التقرير اليومي

source: Attendance Tracker
ar: متتبع الحضور

source: Daily Attendance Report
ar: تقرير الحضور اليومي

source: Loading date...
ar: جاري تحميل التاريخ...

source: Export PDF
ar: تصدير PDF

source: Select Date
ar: تحديد التاريخ

source: Load Report
ar: تحميل التقرير

source: Today
ar: اليوم

source: Loading daily report...
ar: جاري تحميل التقرير اليومي...

source: Total
ar: المجموع

source: Attendance Distribution
ar: توزيع الحضور

source: Employee Attendance Details
ar: تفاصيل حضور الموظف

source: Search employees...
ar: البحث في الموظفين...

source: Department
ar: القسم

source: Check-in Time
ar: وقت تسجيل الدخول

source: Check-out Time
ar: وقت تسجيل الخروج

source: Hours Worked
ar: ساعات العمل المؤداة

source: Loading attendance data...
ar: جاري تحميل بيانات الحضور...

source: Late Arrivals
ar: المتأخرون في الوصول

source: No late arrivals today
ar: لا يوجد متأخرون في الوصول اليوم

source: Absent Employees
ar: الموظفون الغائبون

source: All employees are present today
ar: جميع الموظفين حاضرون اليوم

source: Please select a date
ar: يرجى تحديد تاريخ

source: Could not load report data. Please try again later.
ar: تعذر تحميل بيانات التقرير. يرجى المحاولة مرة أخرى لاحقاً.

source: No attendance records found for this date
ar: لا توجد سجلات حضور لهذا التاريخ

source: DAILY ATTENDANCE REPORT
ar: تقرير الحضور اليومي

source: Attendance Rate:
ar: معدل الحضور:

source: Generated:
ar: المعدل

source: Present:
ar: حاضر:

source: Absent:
ar: غائب:

source: Late:
ar: متأخر:

source: Generated by Al-Saeed University
ar: تم إنشاؤه بواسطة جامعة ال سعيد

source: Error generating PDF report. Please try again.
ar: خطأ في إنشاء تقرير PDF. يرجى المحاولة مرة أخرى.

source: Admin Dashboard - Attendance Tracker
ar: لوحة تحكم المدير - متتبع الحضور

source: Dashboard
ar: لوحة التحكم

source: Welcome back! Here's your real-time attendance overview.
ar: مرحباً بعودتك! إليك نظرة عامة على الحضور في الوقت الفعلي.

source: Quick Actions
ar: الإجراءات السريعة

source: Manage Employees
ar: إدارة الموظفين

source: View and edit employee data
ar: عرض وتعديل بيانات الموظفين

source: Manage Departments
ar: إدارة الأقسام

source: Organize company structure
ar: تنظيم هيكل الشركة

source: View Attendance History
ar: عرض تاريخ الحضور

source: Browse attendance records
ar: تصفح سجلات الحضور

source: Employee Check-In
ar: تسجيل دخول الموظف

source: Face recognition attendance
ar: حضور بالتعرف على الوجه

source: Configure attendance rules
ar: تهيئة قواعد الحضور

source: Alerts
ar: التنبيهات

source: Weekly Attendance Summary
ar: ملخص الحضور الأسبوعي

source: Recent Activity
ar: النشاط الأخير

source: Time
ar: الوقت

source: Loading activity...
ar: جاري تحميل النشاط...

source: No recent activity.
ar: لا يوجد نشاط أخير.

source: Failed to load activity.
ar: فشل في تحميل النشاط.

source: Daily Attendance
ar: الحضور اليومي

source: Failed to load data
ar: فشل في تحميل البيانات

source: Departments
ar: الأقسام

source: Department Management
ar: إدارة الأقسام

source: Manage organizational departments and their information
ar: إدارة أقسام المؤسسة ومعلوماتها

source: Add Department
ar: إضافة قسم

source: Search departments...
ar: البحث في الأقسام...

source: Search
ar: بحث

source: Loading departments...
ar: جاري تحميل الأقسام...

source: No Departments Found
ar: لم يتم العثور على أقسام

source: Get started by creating your first department.
ar: ابدأ بإنشاء قسمك الأول.

source: Department Name
ar: اسم القسم

source: Enter department name
ar: أدخل اسم القسم

source: Create Department
ar: إنشاء قسم

source: Delete Department
ar: حذف قسم

source: Are you sure you want to delete
ar: هل أنت متأكد من أنك تريد الحذف

source: Delete
ar: حذف

source: Total Departments
ar: إجمالي الأقسام

source: Total Employees
ar: إجمالي الموظفين

source: Avg per Department
ar: المتوسط لكل قسم

source: Largest Department
ar: أكبر قسم

source: employees
ar: الموظف

source: N/A
ar: غير متوفر

source: Failed to load departments
ar: فشل في تحميل الأقسام

source: View Employees
ar: عرض الموظفين

source: Edit Department
ar: تعديل قسم

source: Update Department
ar: تحديث قسم

source: Failed to load department details
ar: فشل في تحميل تفاصيل القسم

source: Failed to save department
ar: فشل في حفظ القسم

source: Failed to delete department
ar: فشل في حذف القسم

source: Employee Dashboard
ar: لوحة تحكم الموظف

source: Loading...
ar: جاري التحميل...

source: Profile
ar: الملف الشخصي

source: Logout
ar: تسجيل الخروج

source: Attendance Summary (Current Month)
ar: ملخص الحضور (الشهر الحالي)

source: Working Days
ar: أيام العمل

source: Present Days
ar: أيام الحضور

source: Late Days
ar: أيام التأخر

source: Absent Days
ar: أيام الغياب

source: Total Hours Worked
ar: إجمالي ساعات العمل

source: My Attendance Records
ar: سجلات حضوري

source: Filter
ar: تصفية

source: Hours
ar: ساعات

source: Notes
ar: ملاحظات

source: Previous
ar: السابق

source: Next
ar: التالي

source: Failed to fetch profile
ar: فشل في جلب الملف الشخصي

source: Failed to fetch attendance summary
ar: فشل في جلب ملخص الحضور

source: Failed to fetch attendance records
ar: فشل في جلب سجلات الحضور

source: No attendance records found
ar: لم يتم العثور على سجلات حضور

source: Employee Details
ar: تفاصيل الموظف

source: Back to Employees
ar: العودة إلى الموظفين

source: Loading employee information...
ar: جاري تحميل معلومات الموظف...

source: Edit
ar: تعديل

source: Register Face
ar: تسجيل الوجه

source: Personal Information
ar: المعلومات الشخصية

source: Full Name
ar: الاسم الكامل

source: Employee ID
ar: رقم الموظف

source: Access Code
ar: رمز الوصول

source: Copy access code
ar: نسخ رمز الوصول

source: Work Information
ar: معلومات العمل

source: Position
ar: المنصب

source: Face Registration
ar: تسجيل الوجه

source: This Month
ar: هذا الشهر

source: Generate Report
ar: إنشاء تقرير

source: Recent Check-ins
ar: عمليات الدخول الأخيرة

source: Loading recent activity...
ar: جاري تحميل النشاط الأخير...

source: Edit Employee
ar: تعديل موظف

source: Profile Picture
ar: صورة الملف الشخصي

source: Select Department
ar: اختيار القسم

source: e.g., Software Engineer
ar: مثال: مهندس برمجيات

source: Hire Date
ar: تاريخ التوظيف

source: Please ensure good lighting and look directly at the camera
ar: يرجى التأكد من وجود إضاءة جيدة والنظر مباشرة إلى الكاميرا

source: Capture Face
ar: التقاط الوجه

source: Multiple images will be captured for better accuracy
ar: سيتم التقاط صور متعددة للحصول على دقة أفضل

source: Not provided
ar: غير مقدم

source: Not generated
ar: غير مولد

source: Not assigned
ar: غير مخصص

source: Registered
ar: مسجل

source: Not Registered
ar: غير مسجل

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: No recent activity
ar: لا يوجد نشاط أخير

source: Failed to load activity
ar: فشل في تحميل النشاط

source: Invalid employee ID
ar: رقم موظف غير صحيح

source: Failed to fetch employee details
ar: فشل في جلب تفاصيل الموظف

source: Failed to fetch attendance statistics, using default values
ar: فشل في جلب إحصائيات الحضور، سيتم استخدام القيم الافتراضية

source: Failed to fetch departments
ar: فشل في جلب الأقسام

source: Failed to load employee data for editing.
ar: فشل في تحميل بيانات الموظف للتعديل.

source: Full Name is required.
ar: الاسم الكامل مطلوب.

source: Please enter a valid email address.
ar: يرجى إدخال عنوان بريد إلكتروني صحيح.

source: Please select a department.
ar: يرجى اختيار قسم.

source: Position is required.
ar: المنصب مطلوب.

source: Saving...
ar: جاري الحفظ...

source: Employee updated successfully!
ar: تم تحديث الموظف بنجاح!

source: Failed to update employee
ar: فشل في تحديث الموظف

source: Network error. Please try again.
ar: خطأ في الشبكة. يرجى المحاولة مرة أخرى.

source: Failed to copy access code
ar: فشل في نسخ رمز الوصول

source: Report generated successfully!
ar: تم إنشاء التقرير بنجاح!

source: Failed to generate report.
ar: فشل في إنشاء التقرير.

source: EMPLOYEE ATTENDANCE REPORT
ar: تقرير حضور الموظف

source: Generated on:
ar: تم إنشاؤه في:

source: Employee Information:
ar: معلومات الموظف:

source: Name:
ar: الاسم:

source: ID:
ar: الرقم:

source: Department:
ar: القسم:

source: Position:
ar: المنصب:

source: Status:
ar: الحالة

source: Attendance Statistics:
ar: إحصائيات الحضور:

source: ✓ Present Days:
ar: ✓ أيام الحضور:

source: ⏰ Late Arrivals:
ar: ⏰ التأخيرات:

source: ✗ Absent Days:
ar: ✗ أيام الغياب:

source: Generated by Attendance Tracker System
ar: تم إنشاؤه بواسطة نظام متتبع الحضور

source: Employees Management - Attendance Tracker
ar: إدارة الموظفين - متتبع الحضور

source: Employees Management
ar: إدارة الموظفين

source: Manage all registered employees and their details
ar: إدارة جميع الموظفين المسجلين وتفاصيلهم

source: Add Employee
ar: إضافة موظف

source: Search employees by name or department...
ar: البحث في الموظفين بالاسم أو القسم...

source: All Departments
ar: جميع الأقسام

source: IT Department
ar: قسم تكنولوجيا المعلومات

source: Human Resources
ar: الموارد البشرية

source: Finance
ar: المالية

source: Operations
ar: العمليات

source: ID
ar: الرقم

source: Face Registered
ar: الوجه مسجل

source: Loading employees...
ar: جاري تحميل الموظفين...

source: Showing 0 of 0 employees
ar: عرض 0 من 0 موظف

source: Add New Employee
ar: إضافة موظف جديد

source: Full Name *
ar: الاسم الكامل *

source: Email *
ar: البريد الإلكتروني *

source: Department *
ar: القسم *

source: Position *
ar: المنصب *

source: Failed to fetch employees
ar: فشل في جلب الموظفين

source: Failed to load employees. Please try again.
ar: فشل في تحميل الموظفين. يرجى المحاولة مرة أخرى.

source: No employees found matching your criteria.
ar: لم يتم العثور على موظفين يطابقون معاييرك.

source: Yes
ar: نعم

source: No
ar: لا

source: View Employee
ar: عرض الموظف

source: Setup Face Recognition
ar: إعداد التعرف على الوجه

source: No employees found
ar: لم يتم العثور على موظفين

source: Adding...
ar: جاري الإضافة...

source: Employee added successfully!
ar: تم إضافة الموظف بنجاح!

source: Failed to add employee
ar: فشل في إضافة الموظف

source: Failed to fetch employee data
ar: فشل في جلب بيانات الموظف

source: Employee Attendance - Face Recognition
ar: حضور الموظف - التعرف على الوجه

source: Employee Attendance
ar: حضور الموظف

source: Check-In / Check-Out
ar: تسجيل الدخول / الخروج

source: Check-in: Before 9:30 AM | Check-out: After 10:00 PM
ar: تسجيل الدخول: قبل 9:30 ص | تسجيل الخروج: بعد 10:00 م

source: Select Your Action
ar: اختر إجراءك

source: Choose whether you're checking in or checking out
ar: اختر ما إذا كنت تقوم بتسجيل الدخول أو الخروج

source: Face Recognition Attendance
ar: حضور بالتعرف على الوجه

source: Attempts:
ar: المحاولات:

source: Initializing camera...
ar: جاري تهيئة الكاميرا...

source: Instructions for Best Results
ar: تعليمات للحصول على أفضل النتائج

source: • Position your face in the center of the oval
ar: • ضع وجهك في وسط الدائرة البيضاوية

source: • Ensure good lighting on your face
ar: • تأكد من وجود إضاءة جيدة على وجهك

source: • Look directly at the camera
ar: • انظر مباشرة إلى الكاميرا

source: • Remove sunglasses, hats, or masks
ar: • أزل النظارات الشمسية أو القبعات أو الأقنعة

source: • Stay still when capturing
ar: • ابق هادئاً عند التقاط الصورة

source: Ready to capture your face
ar: جاهز لالتقاط وجهك

source: Click the capture button when ready
ar: اضغط على زر الالتقاط عندما تكون جاهزاً

source: Capture Photo
ar: التقاط صورة

source: Try Again
ar: حاول مرة أخرى

source: Good Lighting
ar: إضاءة جيدة

source: Look at Camera
ar: انظر إلى الكاميرا

source: Center Your Face
ar: ضع وجهك في الوسط

source: Processing Your Photo
ar: جاري معالجة صورتك

source: Please wait while we analyze your facial features...
ar: يرجى الانتظار أثناء تحليل ملامح وجهك...

source: An Error Occurred
ar: حدث خطأ

source: Something went wrong.
ar: حدث خطأ ما.

source: Enter Access Code
ar: أدخل رمز الوصول

source: Verify Code
ar: تحقق من الرمز

source: Welcome, [Employee Name]!
ar: مرحباً، [اسم الموظف]!

source: Camera ready
ar: الكاميرا جاهزة

source: Position your face and click capture
ar: ضع وجهك واضغط على الالتقاط

source: Camera access denied
ar: تم رفض الوصول إلى الكاميرا

source: Please allow camera access to continue
ar: يرجى السماح بالوصول إلى الكاميرا للمتابعة

source: Please select Check In or Check Out first
ar: يرجى اختيار تسجيل الدخول أو الخروج أولاً

source: Face recognition failed
ar: فشل التعرف على الوجه

source: Network error occurred
ar: حدث خطأ في الشبكة

source: Check-In
ar: تسجيل الدخول

source: Check-Out
ar: تسجيل الخروج

source: Successful!
ar: نجح!

source: Welcome,
ar: مرحباً،

source: Time Restriction
ar: قيد زمني

source: Attempt Failed
ar: فشلت المحاولة

source: Attempt
ar: محاولة

source: Ready to capture
ar: جاهز للالتقاط

source: Position your face and try again
ar: ضع وجهك وحاول مرة أخرى

source: Position your face in the center
ar: ضع وجهك في الوسط

source: Face Recognition Failed
ar: فشل التعرف على الوجه

source: We couldn't recognize you after 3 attempts. Please use your access code.
ar: لم نتمكن من التعرف عليك بعد 3 محاولات. يرجى استخدام رمز الوصول.

source: Please enter your access code
ar: يرجى إدخال رمز الوصول

source: Verifying...
ar: جاري التحقق...

source: Checking access code and taking security photo...
ar: جاري التحقق من رمز الوصول والتقاط صورة أمان...

source: Invalid Access Code
ar: رمز وصول غير صحيح

source: The code is incorrect. Please try again.
ar: الرمز غير صحيح. يرجى المحاولة مرة أخرى.

source: Error capturing security photo. Please try again.
ar: خطأ في التقاط صورة الأمان. يرجى المحاولة مرة أخرى.

source: Login - Al-Saeed University
ar: تسجيل الدخول - جامعة ال سعيد

source: Al-Saeed University
ar: جامعة ال سعيد

source: E-mail Address
ar: عنوان البريد الإلكتروني

source: Enter your E-mail
ar: أدخل بريدك الإلكتروني

source: Enter your Password
ar: أدخل كلمة المرور

source: Forgot password?
ar: نسيت كلمة المرور؟

source: Login
ar: تسجيل الدخول

source: Please enter both email and password.
ar: يرجى إدخال البريد الإلكتروني وكلمة المرور.

source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.

source: Monthly Report - Attendance System
ar: التقرير الشهري - نظام الحضور

source: Monthly Attendance Report
ar: تقرير الحضور الشهري

source: Comprehensive monthly attendance analysis and insights
ar: تحليل شامل ومعلومات تفصيلية لحضور الشهر

source: Month:
ar: الشهر:

source: Loading monthly report...
ar: جاري تحميل التقرير الشهري...

source: Total Working Days
ar: إجمالي أيام العمل

source: Average Attendance
ar: متوسط الحضور

source: Total Late Arrivals
ar: إجمالي التأخيرات

source: Perfect Attendance
ar: حضور مثالي

source: Daily Attendance Trend
ar: اتجاه الحضور اليومي

source: Department Attendance
ar: حضور الأقسام

source: Top Performers
ar: أفضل الأداء

source: Attendance Concerns
ar: مخاوف الحضور

source: Employee Monthly Summary
ar: ملخص الموظف الشهري

source: Days Present
ar: أيام الحضور

source: Days Absent
ar: أيام الغياب

source: Attendance %
ar: نسبة الحضور %

source: Failed to load monthly report
ar: فشل في تحميل التقرير الشهري

source: Excellent
ar: ممتاز

source: Good
ar: جيد

source: Needs Improvement
ar: يحتاج تحسين

source: MONTHLY ATTENDANCE REPORT
ar: تقرير الحضور الشهري

source: EMPLOYEE MONTHLY SUMMARY
ar: ملخص الموظف الشهري

source: Error:
ar: خطأ

source: Unknown error occurred
ar: حدث خطأ غير معروف

source: Profile - Attendance Tracker
ar: الملف الشخصي - متتبع الحضور

source: Profile Settings
ar: إعدادات الملف الشخصي

source: Manage your account information and preferences
ar: إدارة معلومات حسابك وتفضيلاتك

source: Account Info
ar: معلومات الحساب

source: Last Login:
ar: آخر تسجيل دخول:

source: Account Created:
ar: تاريخ إنشاء الحساب:

source: Role:
ar: الدور:

source: Update your personal details and contact information
ar: تحديث تفاصيلك الشخصية ومعلومات الاتصال

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Email Address *
ar: عنوان البريد الإلكتروني *

source: Change Password
ar: تغيير كلمة المرور

source: Update your password to keep your account secure
ar: حدث كلمة المرور للحفاظ على أمان حسابك

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Password must be at least 8 characters long
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: The password has been changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: Failed to load profile data
ar: فشل في تحميل بيانات الملف الشخصي

source: File size must be less than 5MB
ar: يجب أن يكون حجم الملف أقل من 5 ميجابايت

source: Avatar updated successfully!
ar: تم تحديث الصورة الرمزية بنجاح!

source: Failed to upload avatar
ar: فشل في رفع الصورة الرمزية

source: Failed to change password
ar: فشل في تغيير كلمة المرور

source: System Settings - Attendance Tracker
ar: إعدادات النظام - متتبع الحضور

source: Configure your attendance system preferences and policies
ar: تهيئة تفضيلات وإجراءات نظام الحضور

source: General
ar: عام

source: Attendance
ar: الحضور

source: Notifications
ar: الإشعارات

source: Security
ar: الأمان

source: General Settings
ar: الإعدادات العامة

source: System Language
ar: لغة النظام

source: Choose the default language for the system
ar: اختر اللغة الافتراضية للنظام

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Date Format
ar: تنسيق التاريخ

source: How dates should be displayed
ar: كيفية عرض التواريخ

source: Time Format
ar: تنسيق الوقت

source: 12-hour or 24-hour clock
ar: ساعة 12 أو 24 ساعة

source: 12-hour (AM/PM)
ar: 12 ساعة (ص/م)

source: 24-hour
ar: 24 ساعة

source: Attendance Policies
ar: إجراءات الحضور

source: Work Start Time
ar: وقت بدء العمل

source: Work End Time
ar: وقت انتهاء العمل

source: Check-in Deadline
ar: مهلة تسجيل الدخول

source: Employees must check in before this time.
ar: يجب على الموظفين تسجيل الدخول قبل هذا الوقت.

source: Checkout Start Time
ar: وقت بدء تسجيل الخروج

source: Employees can only check out after this time.
ar: يمكن للموظفين تسجيل الخروج فقط بعد هذا الوقت.

source: Late Arrival Tolerance (minutes)
ar: تسامح التأخر في الوصول (بالدقائق)

source: Employees arriving after this many minutes will be marked as late
ar: سيتم اعتبار الموظفين الذين يصلون بعد هذا العدد من الدقائق متأخرين

source: Enforce Strict Checkout Policy
ar: فرض إجراء تسجيل خروج صارم

source: If enabled, checkout is only allowed after the official 'Work End Time'.
ar: إذا تم تمكينه، يُسمح بتسجيل الخروج فقط بعد 'وقت انتهاء العمل' الرسمي.

source: Auto Check-out
ar: تسجيل خروج تلقائي

source: Automatically check out employees at end of day
ar: تسجيل خروج الموظفين تلقائياً في نهاية اليوم

source: Weekend Days
ar: أيام نهاية الأسبوع

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Notification Preferences
ar: تفضيلات الإشعارات

source: Email Notifications
ar: إشعارات البريد الإلكتروني

source: Receive email alerts for important events
ar: تلقي تنبيهات البريد الإلكتروني للأحداث المهمة

source: Browser Notifications
ar: إشعارات المتصفح

source: Show desktop notifications
ar: عرض إشعارات سطح المكتب

source: Notification Types
ar: أنواع الإشعارات

source: Late arrivals
ar: التأخيرات في الوصول

source: Absences
ar: الغيابات

source: Overtime hours
ar: ساعات العمل الإضافي

source: System updates
ar: تحديثات النظام

source: Security Settings
ar: إعدادات الأمان

source: Session Timeout (minutes)
ar: مهلة الجلسة (بالدقائق)

source: Automatic logout after inactivity
ar: تسجيل خروج تلقائي بعد الخمول

source: Password Policy
ar: إجراءات كلمة المرور
