Repository: engraad/faceattct
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Require complex passwords
ar: طلب كلمات مرور معقدة

source: Password expiration (90 days)
ar: انتهاء صلاحية كلمة المرور (90 يوماً)

source: Prevent password reuse
ar: منع إعادة استخدام كلمة المرور

source: Two-Factor Authentication
ar: المصادقة الثنائية

source: Add an extra layer of security to your account
ar: إضافة طبقة إضافية من الأمان لحسابك

source: API Access
ar: وصول API

source: Enable REST API for integration
ar: تمكين REST API للتكامل

source: Save Settings
ar: حفظ الإعدادات

source: Failed to load settings. Using default values.
ar: فشل في تحميل الإعدادات. سيتم استخدام القيم الافتراضية.

source: Weekly Report - Academia
ar: التقرير الأسبوعي - الأكاديميا

source: Weekly Attendance Report
ar: تقرير الحضور الأسبوعي

source: Loading week dates...
ar: جاري تحميل تواريخ الأسبوع...

source: Print
ar: طباعة

source: Generating weekly report...
ar: جاري إنشاء التقرير الأسبوعي...

source: Attendance Summary
ar: ملخص الحضور

source: Day
ar: اليوم

source: Avg. Check-in Time
ar: متوسط وقت تسجيل الدخول

source: Weekly Attendance Average
ar: متوسط الحضور الأسبوعي

source: Employee Punctuality
ar: انتظام الموظفين

source: Most Punctual
ar: الأكثر انتظاماً

source: Least Punctual
ar: الأقل انتظاماً

source: Week of
ar: أسبوع

source: No data available
ar: لا توجد بيانات متاحة

source: WEEKLY ATTENDANCE REPORT
ar: تقرير الحضور الأسبوعي

source: Weekly Average:
ar: المتوسط الأسبوعي:

source: Attendance Trend
ar: اتجاه الحضور

source: Most Punctual:
ar: الأكثر انتظاماً:

source: Least Punctual:
ar: الأقل انتظاماً:

source: Welcome - Attendance System
ar: الترحيب - نظام الحضور

source: Welcome to Your
ar: مرحباً بك في

source: Workplace
ar: مكان عملك

source: Ready to start your journey with us? Let's get you set up for success.
ar: جاهز لبدء رحلتك معنا؟ دعنا نساعدك في الإعداد للنجاح.

source: Secure • Fast • Easy Setup
ar: آمن • سريع • إعداد سهل

source: Face Recognition
ar: التعرف على الوجه

source: Quick & secure identification
ar: تحديد سريع وآمن

source: Time Tracking
ar: تتبع الوقت

source: Automated attendance logging
ar: تسجيل الحضور التلقائي

source: Analytics
ar: التحليلات

source: Track your progress
ar: تتبع تقدمك

source: Click Here to Prepare You for This Day
ar: اضغط هنا للتحضير لهذا اليوم

source: Already registered?
ar: مسجل بالفعل؟

source: Go to Login
ar: الذهاب إلى تسجيل الدخول

source: This setup will take approximately 2-3 minutes
ar: سيستغرق هذا الإعداد حوالي 2-3 دقائق

source: New Employee Setup
ar: إعداد موظف جديد

source: Secure Process
ar: عملية آمنة

source: Support Available
ar: دعم متاح

source: Preparing Your Setup
ar: جاري تحضير إعدادك

source: Please wait while we initialize your onboarding process...
ar: يرجى الانتظار أثناء تهيئة عملية التهيئة الخاصة بك...

source: Need Help?
ar: تحتاج مساعدة؟

source: What is this setup?
ar: ما هذا الإعداد؟

source: Is it secure?
ar: هل هو آمن؟

source: How long does it take?
ar: كم يستغرق الوقت؟

source: Need additional support?
ar: تحتاج دعماً إضافياً؟

source: Email Support
ar: دعم البريد الإلكتروني

source: Call Support
ar: دعم الهاتف

source: Employee Portal
ar: بوابة الموظف

source: Employees
ar: الموظفون

source: Account Management
ar: إدارة الحساب

source: Attendance History
ar: تاريخ الحضور

source: Reports
ar: التقارير

source: Weekly Report
ar: التقرير الأسبوعي

source: Monthly Report
ar: التقرير الشهري

source: Settings
ar: الإعدادات

source: Help
ar: المساعدة

source: Help & About - Attendance System
ar: المساعدة ونظام الحضور

source: Help & Documentation
ar: المساعدة والتوثيق

source: Everything you need to know about the Facial Recognition Attendance System
ar: كل ما تحتاج إليه عن نظام التعرف على الوجه للحضور

source: Learn how to use the facial recognition check-in system
ar: تعلم كيفية استخدام نظام التعرف على الوجه للحضور

source: Learn More →
ar: تعلم المزيد →

source: Access Codes
ar: أرقام الوصول

source: How to use your unique access code for check-in
ar: كيفية استخدام رمز الوصول الخاص بك للحضور

source: Understanding attendance reports and analytics
ar: فهم تقارير الحضور والتحليلات

source: Getting Started
ar: البدء

source: First Time Setup
ar: الإعداد للمرة الأولى

source: When you first join the company, your face will be registered in the system by HR. You'll also receive a unique 6-digit access code as a backup method.
ar: عندما تنضم إلى الشركة للمرة الأولى، سيتم تسجيل وجهك في النظام بواسطة قسم الموارد البشرية. ستحصل أيضاً على رمز وصول مكون من 6 أرقام كطريقة احتياطية.

source: Daily Check-In
ar: تسجيل الدخول اليومي

source: Use any of the three methods: Face Recognition, Biometric Scan, or Access Code. The system automatically determines if you're checking in or out based on your last activity.
ar: استخدم أي من الطرق الثلاثة: التعرف على الوجه، المسح البيومتري، أو رمز الوصول. يحدد النظام تلقائياً إذا كنت تقوم بتسجيل الدخول أو الخروج بناءاً على حركتك الأخيرة.

source: Face Recognition Check-In
ar: تسجيل الدخول بالتعرف على الوجه

source: How to Use
ar: كيفية الاستخدام

source: Navigate to the Face Recognition page
ar: الانتقال إلى صفحة التعرف على الوجه

source: Allow camera access when prompted
ar: السماح بوصول الكاميرا عندما يتم الطلب

source: Position your face in the camera frame
ar: ضع وجهك في إطار الكاميرا

source: Click "Capture Face" when ready
ar: اضغط "التقط الوجه" عندما تكون جاهزاً

source: Wait for recognition and confirmation
ar: انتظر التعرف والتأكيد

source: Tips for Best Results
ar: نصائح للحصول على أفضل النتائج

source: Ensure good lighting on your face
ar: تأكد من وجود إضاءة جيدة على وجهك

source: Look directly at the camera
ar: انظر مباشرة إلى الكاميرا

source: Remove sunglasses or masks
ar: أزل النظارات الشمسية أو الأقنعة

source: Keep your face centered in the frame
ar: ابق وجهك مركزاً في الإطار

source: Stay still during capture
ar: ابق هادئاً أثناء التقط

source: Access Code Check-In
ar: تسجيل الدخول برمز الوصول

source: Using Your Access Code
ar: استخدام رمز وصولك

source: Go to the Code Check-In page
ar: الانتقال إلى صفحة تسجيل الدخول بالرمز

source: Enter your 6-digit access code
ar: أدخل رمز وصولك المكون من 6 أرقام

source: Click Submit or press Enter
ar: اضغط إرسال أو اضغط Enter

source: Wait for verification
ar: انتظر التحقق

source: Receive confirmation message
ar: استلم رسالة التأكيد

source: Important Notes
ar: ملاحظات مهمة

source: Your access code is unique to you
ar: رمز الوصول خاص بك وحدك

source: Keep your code confidential
ar: احفظ سرية رمزك

source: Contact HR if you forget your code
ar: اتصل بقسم الموارد البشرية إذا نسيت رمزك

source: Codes are case-sensitive
ar: الأرقام تكون حساسة لحالة الأحرف

source: Use as backup when face recognition fails
ar: استخدم كبديل عندما يفشل التعرف على الوجه

source: Understanding Reports
ar: فهم التقارير

source: Daily Reports
ar: التقارير اليومية

source: View attendance for a specific day, including who is present, absent, or late.
ar: عرض الحضور ليوم معين، مع من حاضر، غائب، أو متأخر.

source: Summary statistics (present, absent, late counts)
ar: إحصائيات ملخصة (عدد الحاضرين، الغائبين، المتأخرين)

source: Detailed attendance table with check-in/out times
ar: جدول حضور مفصل مع أوقات تسجيل الدخول/الخروج

source: Late arrivals list
ar: قائمة الواصلين المتأخرين

source: Absent employees list
ar: قائمة الموظفين الغائبين

source: Weekly Reports
ar: التقارير الأسبوعية

source: Analyze attendance patterns over a week (Monday to Friday).
ar: تحليل أنماط الحضور على مدى أسبوع (من الاثنين إلى الجمعة).

source: Daily attendance breakdown
ar: تفصيل الحضور اليومي

source: Average check-in times per day
ar: متوسط أوقات تسجيل الدخول كل يوم

source: Most and least punctual employees
ar: أكثر الموظفين المنتظمين

source: Attendance trends visualization
ar: تخطيط إتجاهات الحضور

source: Troubleshooting
ar: الإصلاح

source: Face Recognition Not Working
ar: التعرف على الوجه لا يعمل

source: Check camera permissions in your browser
ar: تحقق من إذن الكاميرا في متصفحك

source: Ensure adequate lighting
ar: تأكد من وجود إضاءة كافية

source: Try the access code method instead
ar: جرب طريقة رمز الوصول بدلاً منه

source: Contact IT support if issues persist
ar: اتصل بدعم المعلوماتية إذا استمرت المشكلات

source: Forgot Access Code
ar: نسيت رمز الوصول

source: Check your employee profile
ar: تحقق من ملف موظفك الشخصي

source: Contact HR department
ar: اتصل بقسم الموارد البشرية

source: Use face recognition as alternative
ar: استخدم التعرف على الوجه كبديل

source: Request code reset from admin
ar: اطلب إعادة تعيين الرمز من المسؤول

source: System Not Responding
ar: النظام لا يستجيب

source: Refresh the page
ar: أعد تحديث الصفحة

source: Clear browser cache
ar: مسح ذاكرة المتصفح

source: Try a different browser
ar: جرب متصفح مختلف

source: Report to IT support
ar: الإبلاغ عن دعم المعلوماتية

source: About This System
ar: حول هذا النظام

source: System Information
ar: معلومات النظام

source: Version:
ar: الإصدار:

source: Last Updated:
ar: آخر تحديث:

source: December 2024
ar: كانون 2024

source: Technology:
ar: التقنية:

source: AI-Powered
ar: مدعوم بالذكاء الاصطناعي

source: Security:
ar: الأمان:

source: Enterprise Grade
ar: مستوى شركة

source: Features
ar: الميزات

source: Facial Recognition Technology
ar: تقنية التعرف على الوجه

source: Biometric Authentication
ar: المصادقة البيومترية

source: Access Code Backup
ar: نسخة احتياطية برمز الوصول

source: Real-time Attendance Tracking
ar: تتبع الحضور في الوقت الفعلي

source: Comprehensive Reporting
ar: تقارير شاملة

source: Mobile-Friendly Interface
ar: واجهة متجاوبة مع الجوال

source: Need More Help?
ar: تحتاج مساعدة أكثر؟

source: Phone Support
ar: دعم الهاتف

source: Support Hours
ar: ساعات الدعم

source: Mon-Fri, 9AM-5PM
ar: الاثنين-الجمعة، 9صباحاً-5مساءً
